package ch_operator;

public class Task1 {

	public static void main(String[] args) {
//		문제1.
//		 int 형 변수 num1, num2, num3가 각각 10,20,30 으로 초기화 되어 있다.
//		다음문장을 실행하면 각각 변수에는 어떠한 값이 저장되겠는가?
//		num1=num2=num3 ;
//		확인 하는 코드를 작성하고, 그 결과에 대해 설명.

		int num1=10,num2=20,num3=30;
		num1=num2=num3 ;
		System.out.println("num1 = "+num1+"  num2 = "+num2+"  num3 = "+num3);
		
// [결과]: 		
// num1 = 30  num2 = 30  num3 = 30
// [해석]		
// num3의 값이 num2 에 할당, num2의 값이 num1에 할당(오른쪽에서 왼쪽으로 진행)
//		
//--------------------------------------------------------------------------------------------		
//		
//		문제2.
//		수학식 {{(25x5)+(36-4)}-72}/5 의 계산결과를 출력하는 프로그램 작성.
//
		System.out.println((((25*5)+(36-4))-72)/5);
// [결과]:
// 17
// [해석]
// (((25*5)+(36-4))-72)/5 -> ((125+32)-72)/5 -> (157-72)/5 -> 85/5 -> 17 
//
//
//--------------------------------------------------------------------------------------------
//
//		문제3.
//		3+6, 3+6+9, 3+6+9+12 의 연산을 하는 프로그램 작성.
//		단. 덧셈 연산의 횟수 최소화
		
		int nSum=0;		
		
		for(int i=1;i<=4;i++) {						
			nSum = nSum + (i*3);
			
			if(i==2) {
				System.out.println("3+6 = "+nSum);
			}
			else if(i==3) {
				System.out.println("3+6+9 = "+nSum);				
			}
			else if(i==4) {	
				System.out.println("3+6+9+12 = "+nSum);				
			}
			else {
				
			}			
		}
		
//
// [결과]:
//3+6 = 9
//3+6+9 = 18
//3+6+9+12 = 30 
//
//--------------------------------------------------------------------------------------------
//
//
//		문제4.
//		a= {{(25+5)+(36/4)}-72}*5, b= {{(25x5)+(36-4)}-71}/4, c=(128/4)*2 일 때
//		a>b>c 가 참이면 true 아니면 false를 출력하는 프로그램 작성

		float a=0;
		float b=0;
		float c=0;
		
		a= (float)( (((25+5)+(36/4))-72)*5 ); //-165
		b= (float)(((25*5)+(36-4))-71)/4; //21.5   변수값이 왜 21.0 으로 잡히는지 궁금함.
		c= (float)( (128/4)*2 );					//64
		
		if((a>b) && (b>c)) {
			System.out.println("The Result is true");
		}
		else {
			System.out.println("The Result is false");
		}
		System.out.println("The Result is a = "+a+" b = "+b+" c = "+c);
		
		
		
		
// [결과]:
// The Result is a = -165.0 b = 21.0 c = 64.0
// [해석]
// ( (((25*5)+(36-4))-71)/4 ); //21.5   변수값이 왜 21.0 으로 잡히는지 궁금함.
//--------------------------------------------------------------------------------------------

	}

}
